import React, { Component } from 'react';
import { View } from '@tarojs/components';

import './index.scss';

class Index extends Component {
  constructor() {
    super(...arguments);
  }

  componentWillMount() {}

  componentDidMount() {}

  componentWillUnmount() {}

  componentDidShow() {}

  componentDidHide() {}

  render() {
    return (
      <View className='user-privacy'>
        <View>
          本政策仅适用于片名猜猜猜产品或服务，最近更新日期:2021年3月。如果您有任何疑问、意见或建议，请通过以下联系方式与我们联系:电子邮件:duanyu@idgee.cn
        </View>
        <View>本政策将帮助您了解以下内容</View>
        <View className='h4'>-业务功能一的个人信息收集使用规则</View>
        <View className='h4'>-业务功能二的个人信息收集使用规则</View>
        <View className='h4'>-我们如何保护您的个人信息</View>
        <View className='h4'>-您的权利</View>
        <View className='h4'>-我们如何处理儿童的个人信息</View>
        <View className='h4'>-本政策如何更新</View>
        <View className='h4'>-如何联系我们</View>
        <View>
          片名猜猜猜深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息:权责一致原则、目的明确原则、选择同意原则、最小必要原则、确保安全原则、主体参与原则、公开透明原则等。同时，片名猜猜猜承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
        </View>
        <View>
          请在使用我们的产品或服务前，仔细阅读并了解本《个人信息保护政策》。
        </View>
        <View className='h4'>业务功能一的个人信息收集使用规则</View>
        <View className='h4'>1、我们收集哪些你的个人信息</View>
        <View>
          -我们提供的业务功能需要依赖部分信息才得以运行。您选择使用该项业务功能，则需要向我们提供或允许我们收集的必要信息包括:头像和昵称共计两类个人信息。
        </View>
        <View>
          -您可自主选择向我们提供或允许我们收集下列信息:头像和昵称共计两类个人信息。这些信息并非该业务功能运行所必需，但这些信息对改善服务质量，研发新产品或服务等有非常重要的意义。我们不会强制要求您提供这些信息，您如拒绝不会对使用该业务功能产生不利影响
        </View>
        <View className='h4'>2、我们如何使用您的个人信息</View>
        <View>
          -对于头像和昵称的个人信息，我们会用来提供该项业务功能，包括签到,猜电影,查看片名等..我们也会使用上述信息来维护和改进本项业务功能，开发新的业务功能等。
        </View>
        <View className='h4'>
          3、我们如何委托处理、共享、转让、公开披露您的个人信息
        </View>
        <View className='h4'> 1.委托处理</View>
        <View>
          本业务功能中某些具体的模块或功能由外部供应商提供。例如我们会聘请服务提供商来协助我们提供客户支持。
        </View>
        <View>
          对我们委托处理个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的要求、本个人信息保护政策以及其他任何相关的保密和安全措施来处理个人信息。
        </View>
        <View className='h4'>2.共享</View>
        <View>
          我们不会与本公司以外的任何公司、组织和个人分享您的个人信息。我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
        </View>
        <View className='h4'>3.转让</View>
        <View>
          我们不会将您的个人信息转让给任何公司、组织和个人，但以下情形除外:
        </View>
        <View>
          在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司组织继续受此个人信息保护政策的约束，否则我们将要求该公司、组织重新向您征求授权同意
        </View>
        <View className='h4'>4.公开披露</View>
        <View>我们仅会在以下情形下，公开披露您的个人信息:</View>
        <View>
          基于法律的披露:在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
        </View>
        <View className='h4'>业务功能二的个人信息收集使用规则</View>
        <View className='h4'>我们如何保护您的个人信息</View>
        <View>
          (一)我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施,保护您的个人信息,例如:账号均有安全保护功能，数据库双重备份等
        </View>
        <View>
          (二)我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许
        </View>
        <View>
          (三)互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏,导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
        </View>
        <View>
          (四)在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时想您高职:安全时间的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理，有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
        </View>
        <View className='h4'>您的权利</View>
        <View>
          按照中国相关的法律、法规、标准，以及其他国家，地区的通行做法，我们保障您对自己的个人信息行使以下权利:
        </View>
        <View className='h4'>(一)访问您的个人信息</View>
        <View>
          您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问:片名猜猜猜小程序
        </View>
        <View className='h4'>(二)更正您的个人信息</View>
        <View>
          当您发现我们处理的关于您的个人信息有错误时，您有权要求我们作出更正。您可以通过"(一)访问您的个人信息"中罗列的方式提出更正申请。
        </View>
        <View>
          如果您无法通过上述链接更正这些个人信息，您可以随时使用我们的Web表单联系，或发送电子邮件至duanyu@idgee.cn我们将在30天内回复您的更正请求。
        </View>
        <View className='h4'>(三)删除您的个人信息</View>
        <View>在以下情形中，您可以向我们提出删除个人信息的请求:</View>
        <View>1、如果我们处理个人信息的行为违反法律法规;</View>
        <View>2、如果我们收集、使用您的个人信息，却未征得您的同意;</View>
        <View>3、如果我们处理个人信息的行为违反了与您的约定;</View>
        <View>4、如果您不再使用我们的产品或服务，或您注销了账号;</View>
        <View>5、如果我们不再为您提供产品或服务。</View>
        <View>
          若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
        </View>
        <View>
          当您从我们的服务中删除信息后，我们可能不会立即在备份系统中删除相应的信息，但会在备份更新时删除这些信息。
        </View>
        <View className='h4'>(四)改变您授权同意的范围</View>
        每个业务功能需要一些基本的个人信息才能得以完成。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。
        您可以通过以下方式自行操作:关闭小程序里的授权或联系小程序里面客服注销删除个人信息
        当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。
        <View className='h4'>(五)个人信息主体注销账户</View>
        您随时可注销此前注册的账户，您可以通过以下方式自行操作:小程序里联系客服或发邮件duanyu@idgee.cn。在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，
        删除您的个人信息，法律法规另有规定的除外。
        <View className='h4'>(六)约束信息系统自动决策</View>
        在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们作出解释，我们也将提供适当的救济方式。
        <View className='h4'>(七)响应您的上述请求</View>
        为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
        我们将在三十天内作出答复。如您不满意，还可以通过以下途径投诉:片名猜猜猜小程序里联系客服或发邮件duanyu@idgee.cn
        对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段(例如,需要开发新系统或从根本上改编现行惯例),给他人合
        法权益带来风险或者非常不切实际(例如，涉及备份磁带上存放的信息)的请求，我们可能会予以拒绝。
        <View>在以下情形中,我们将无法响应您的请求</View>
        <View>1、个人信息控制者履行法律法规规定的义务相关的;</View>
        <View>2、与国家安全、国防安全直接相关的;</View>
        <View>3、与公共安全、公共卫生、重大公共利益直接相关的;</View>
        <View>4、与刑事侦查、起诉、审判和执行判决等直接相关的</View>
        <View>
          5、个人信息控制者有充分证据表明个人信息主体存在主观恶意或滥用权利的;
        </View>
        <View>
          6、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的:
        </View>
        <View>
          7、响应个人信息主体的请求将导致个人信息主体或其他个人、组织的合法权益受到严重损害的;涉及商业秘密的。
        </View>
        <View className='h4'>我们如何处理儿童的个人信息</View>
        我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意儿童不应创建自己的个人信息主体账户。
        父母或监护人明确同意或者保护儿童所必要的情况下使用或公开披露此信 息。
        尽管当地法律和习俗对儿童的定义不同，但我们将不满14周岁的任何人均视为儿童。
        如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
        <View className='h4'>本政策如何更新</View>
        <View>我们的个人信息保护政策可能变更。</View>
        未经您明确同意，我们不会削减您按照本个人信息保护政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知(包括对于某些
        内容)。 <View>本政策所指的重大变更包括但不限于:</View>
        <View>
          1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等;
        </View>
        <View>
          2、我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等;
        </View>
        <View>3、个人信息共享转让或公开披露的主要对象发生变化;</View>
        <View>4、您参与个人信息处理方面的权利及其行使方式发生重大变化;</View>
        <View>
          5、我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时;
        </View>
        <View>
          6、个人信息安全影响评估报告表明存在高风险时。我们还会将本政策的旧版本存档，供您查阅。
        </View>
        <View className='h4'>如何联系我们</View>
        如果您对本个人信息保护政策有任何疑问、意见或建议，通过以下方式与我们联系:duanyu@idgee.cn
        一般情况下，我们将在三十天内回复。
      </View>
    );
  }
}

export default Index;
